ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gatt.h
/***************************************************************************//**
* \file cy_ble_gatt.h
* \version 2.0
*
* \brief
*  Contains the prototypes and constants used in the BLE GATT profile.
*
********************************************************************************
* \copyright
* Copyright 2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


#ifndef CY_BLE_GATT_H
#define CY_BLE_GATT_H

#include "BLE_config.h"
#include "cy_ble_gap.h"


#if (CY_BLE_MODE_PROFILE)

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/***************************************
* Conditional Compilation Parameters
***************************************/

#define CY_BLE_GATT_ROLE           (CY_BLE_CONFIG_GATT_ROLE)
#define CY_BLE_GATT_SERVER         (0x01u)
#define CY_BLE_GATT_CLIENT         (0x02u)
#define CY_BLE_GATT_BOTH           (CY_BLE_GATT_SERVER | CY_BLE_GATT_CLIENT)

#define CY_BLE_GATT_ROLE_SERVER    (0u != (CY_BLE_GATT_ROLE & CY_BLE_GATT_SERVER))
#define CY_BLE_GATT_ROLE_CLIENT    (0u != (CY_BLE_GATT_ROLE & CY_BLE_GATT_CLIENT))

#if (CY_BLE_GATT_ROLE_SERVER)

#endif /* CY_BLE_GATT_ROLE_SERVER */

#define CY_BLE_GATT_DB_CCCD_COUNT              (CY_BLE_CONFIG_GATT_DB_CCCD_COUNT)

#if (CY_BLE_GATT_DB_CCCD_COUNT == 0u)
    #define CY_BLE_GATT_DB_FLASH_CCCD_COUNT    (1u)
#else
    #define CY_BLE_GATT_DB_FLASH_CCCD_COUNT    (CY_BLE_GATT_DB_CCCD_COUNT)
#endif /* CY_BLE_GATT_DB_CCCD_COUNT == 0u */

#define CY_BLE_CCCD_CRC_BYTE                   (0x1u)        /**< CCCD CRC byte */  

/**
 * \addtogroup group_ble_common_api_gatt_definitions
 * @{
 */

/***************************************
* Data Types
***************************************/

/** Service data received with read by group type response during discovery process */
typedef struct
{
    cy_stc_ble_gatt_attr_handle_range_t range;           /**< Handle range of the request */
    uint16_t                            uuid;            /**< 16-bit UUID */
}cy_stc_ble_disc_srvc_info_t;

/** Service data received with read by group type response during discovery process including 128 bit UUID */
typedef struct
{
    cy_stc_ble_gatt_attr_handle_range_t range;           /**< Handle range of the request */
    cy_ble_uuid_t                       uuid;            /**< 128-bit UUID */
}cy_stc_ble_disc_srvc128_info_t;

/** Service data that includes data received with read by group type response and connHandle */
typedef struct
{
    cy_stc_ble_conn_handle_t       connHandle;           /**< The connection handle */
    cy_stc_ble_disc_srvc128_info_t *srvcInfo;            /**< Service data */
    uint8_t                        uuidFormat;           /**< UUID Format - 16-bit (0x01) or 128-bit (0x02) */
}cy_stc_ble_disc_srv_info_t;

/** Included service data received with read by type response during discovery process */
typedef struct
{
    cy_stc_ble_conn_handle_t            connHandle;      /**< The connection handle */
    cy_ble_gatt_db_attr_handle_t        inclDefHandle;   /**< Included definition handle */
    cy_stc_ble_gatt_attr_handle_range_t inclHandleRange; /**< Included declaration handle range */
    cy_ble_uuid_t                       uuid;            /**< Included UUID */
    uint8_t                             uuidFormat;      /**< UUID Format - 16-bit (0x01) or 128-bit (0x02) */
}cy_stc_ble_disc_incl_info_t;

/** Characteristic data received with read by type response during discovery process */
typedef struct
{
    cy_stc_ble_conn_handle_t     connHandle;        /**< The connection handle */
    cy_ble_gatt_db_attr_handle_t charDeclHandle;    /**< Handle for characteristic declaration */
    uint8_t                      properties;        /**< Properties for value field */
    cy_ble_gatt_db_attr_handle_t valueHandle;       /**< Handle to server database attribute value entry */
    cy_ble_uuid_t                uuid;              /**< Characteristic UUID */
    uint8_t                      uuidFormat;        /**< UUID Format - 16-bit (0x01) or 128-bit (0x02) */
}cy_stc_ble_disc_char_info_t;

/** Characteristic Attribute handle + properties structure */
typedef struct
{
    /** Properties for value field */
    uint8_t                      properties;

    /** Handle of server database attribute value entry */
    cy_ble_gatt_db_attr_handle_t valueHandle;
}cy_stc_ble_srvr_char_info_t;

/** Characteristic descriptor data received with find info response during discovery process */
typedef struct
{
    cy_stc_ble_conn_handle_t     connHandle;        /**< The connection handle */
    cy_ble_gatt_db_attr_handle_t descrHandle;       /**< Descriptor handle */
    cy_ble_uuid_t                uuid;              /**< Descriptor UUID */
    uint8_t                      uuidFormat;        /**< UUID Format - 16-bit (0x01) or 128-bit (0x02) */
}cy_stc_ble_disc_descr_info_t;

/** Structure with Generic Attribute Service (GATTS) attribute handles */
typedef struct
{
    cy_ble_gatt_db_attr_handle_t serviceHandle;          /**< Service handle */
    cy_ble_gatt_db_attr_handle_t serviceChangedHandle;   /**< Handle of the Service Changed characteristic */
    cy_ble_gatt_db_attr_handle_t cccdHandle;             /**< Client Characteristic Configuration descriptor handle */
} cy_stc_ble_gatts_t;

/** Structure for return a possible range of the current characteristic descriptor. */
typedef struct
{
    cy_stc_ble_conn_handle_t            connHandle;      /**< The connection handle */
    cy_stc_ble_gatt_attr_handle_range_t range;           /**< Handle range of the request */
    uint32_t                            srviIncIdx;      /**< A non-zero value indicates that the characteristic index
                                                          *   should be incremented
                                                          */
}
cy_stc_ble_disc_range_info_t;

/** Structure with discovered attributes information of Generic Attribute
 *  Service (GATTS) */
typedef struct
{
    cy_stc_ble_srvr_char_info_t  serviceChanged;         /**< Handle of the Service Changed characteristic */
    cy_ble_gatt_db_attr_handle_t cccdHandle;             /**< Client Characteristic Configuration descriptor handle */
} cy_stc_ble_gattc_t;

/** Structure to store bonding data */
typedef struct
{
    /** Stack internal bonding data */
    uint8_t stackFlashptr[CY_BLE_STACK_FLASH_SIZE];

