ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gatt.h
    /** CCCD values */
    uint8_t attValuesCCCDFlashMemory[CY_BLE_MAX_BONDED_DEVICES + CY_BLE_CONN_COUNT][CY_BLE_GATT_DB_FLASH_CCCD_COUNT + CY_BLE_CCCD_CRC_BYTE];

    /** Number of CCCD */
    uint8_t cccdCount; /* CY_BLE_GATT_DB_CCCD_COUNT */

    /** Number of bonded devices */
    uint8_t boundedDevCount; /* CY_BLE_MAX_BONDED_DEVICES */
}cy_stc_ble_flash_storage_t;

/** BLE Configuration parameters structure */
typedef struct
{
    /** BLESS Power enum reflecting power level values supported by BLESS radio */
    cy_en_ble_bless_pwr_lvl_t txPowerLevelAdv;

    /** BLESS Power enum reflecting power level values supported by BLESS radio */
    cy_en_ble_bless_pwr_lvl_t txPowerLevelConn;

    /** IO capability */
    cy_en_ble_gap_iocap_t     securityIoCapability;

    /** Defines paring method */
    uint8_t                   securityPairingMethod;

    /** Silicon Device Address Enabled  */
    uint8_t                   siliconDeviceAddressEnabled;

    /** Index count for GATT DB  */
    uint16_t                  gattDbIndexCount;
}cy_stc_ble_params_t;

#endif  /* (CY_BLE_MODE_PROFILE) */

/** BLE Configuration structure */
typedef struct
{
#if (CY_BLE_MODE_PROFILE)
    /** Pointer to advertising information structure*/
    cy_stc_ble_gapp_disc_mode_info_t *discoveryModeInfo;

    /** Pointer to advertising configuration structure*/
    cy_stc_ble_gapp_adv_params_t     *gappAdvParams;

    /** Pointer to Discovery information collected by Client structure*/
    cy_stc_ble_gapc_disc_info_t      *discoveryInfo;

    /** Pointer to scan configuration structure*/
    cy_stc_ble_gapc_scan_params_t    *gapcScanParams;

    /** Pointer to structure to store bonding data */
    const cy_stc_ble_flash_storage_t *flashStorage;

    /** Pointer to structure with Generic Attribute Service (GATTS) attribute handles */
    const cy_stc_ble_gatts_t         *gatts;

    /** Pointer to structure with Generic Access Profile Service (GAPS) attribute handles */
    const cy_stc_ble_gaps_t          *gaps;

    /** Pointer to cy_ble_attValuesCCCD */
    uint8_t                          *attValuesCCCD;

    /** Pointer to GATT Database structure used in the GAP server */
    const cy_stc_ble_gatts_db_t      *gattDB;

    /** Pointer to Authentication Parameters Information structure */
    cy_stc_ble_gap_auth_info_t       *authInfo;

    /** Pointer to BLE Configuration Parameters structure */
    const cy_stc_ble_params_t        *params;

    /** An application layer event callback function to
    *  receive service events from the BLE Component */
    cy_ble_callback_t        callbackFunc;

    /** Bluetooth Device Address */
    cy_stc_ble_gap_bd_addr_t *deviceAddress;
#endif  /* (CY_BLE_MODE_PROFILE) */

    /** BLESS interrupt configuration */
    const cy_stc_sysint_t *blessIsrConfig;

#if (CY_BLE_STACK_MODE_HOST_UART)
    /** UART interrupt configuration for Host */
    const cy_stc_sysint_t          *uartHostIsrConfig;

    /** UART driver configuration for Host */
    const cy_stc_scb_uart_config_t *uartHostConfig;

    /** UART driver hardware instance */
    CySCB_Type                     *uartHostHw;
#endif /* CY_BLE_STACK_MODE_HOST_UART */

#if (CY_BLE_CONFIG_STACK_MODE_CONTR_UART)
    /** UART interrupt configuration */
    const cy_stc_sysint_t          *uartIsrConfig;

    /** UART driver configuration */
    const cy_stc_scb_uart_config_t *uartConfig;

    /** UART driver hardware instance */
    CySCB_Type                     *uartHw;
#endif /* (CY_BLE_CONFIG_STACK_MODE_CONTR_UART) */
}cy_stc_ble_config_t;

/** @} group_ble_common_api_gatt_definitions */


/***************************************
* Function Prototypes
***************************************/
/** \cond IGNORE */
cy_en_ble_api_result_t Cy_BLE_Init(cy_stc_ble_config_t *config);
/** \endcond */


#if (CY_BLE_MODE_PROFILE)

#if (CY_BLE_GATT_ROLE_SERVER)
cy_en_ble_api_result_t Cy_BLE_GATTS_ReInitGattDb(void);
#endif /* CY_BLE_GATT_ROLE_SERVER */

/**
 * \addtogroup group_ble_common_api_functions
 * @{
 */
cy_en_ble_api_result_t Cy_BLE_SetLocalName(const char8 name[]);
cy_en_ble_api_result_t Cy_BLE_GetLocalName(char8 name[]);
/** @} group_ble_common_api_functions */


#if (CY_BLE_GATT_ROLE_CLIENT)
/**
 * \addtogroup group_ble_common_api_gatt_client_functions
 * @{
 */
cy_en_ble_api_result_t Cy_BLE_GATTC_StartDiscovery(cy_stc_ble_conn_handle_t connHandle);
cy_en_ble_api_result_t Cy_BLE_GATTC_StartPartialDiscovery(cy_stc_ble_conn_handle_t connHandle,
                                                          cy_ble_gatt_db_attr_handle_t startHandle,
                                                          cy_ble_gatt_db_attr_handle_t endHandle);
/** @} group_ble_common_api_gatt_client_functions
 */
#endif /* CY_BLE_GATT_ROLE_CLIENT */



/***************************************
* Private Function Prototypes
***************************************/

#if (CY_BLE_GATT_ROLE_SERVER)

cy_en_ble_gatt_err_code_t Cy_BLE_GATTS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam);
cy_en_ble_gatt_err_code_t Cy_BLE_GATTS_ReadAttributeValueCCCDReqHandler(const cy_stc_ble_gatts_char_val_read_req_t *param);

/**
 * \addtogroup group_ble_common_api_gatt_server_functions
 * @{
 */
cy_en_ble_gatt_err_code_t Cy_BLE_GATTS_WriteAttributeValueCCCD(cy_stc_ble_gatts_db_attr_val_info_t *param);
cy_en_ble_gatt_err_code_t Cy_BLE_GATTS_ReadAttributeValueCCCD(cy_stc_ble_gatts_db_attr_val_info_t *param);
/** @} group_ble_common_api_gatt_server_functions */

#endif /* CY_BLE_GATT_ROLE_SERVER */

#if (CY_BLE_GATT_ROLE_CLIENT)

void Cy_BLE_GATTC_DiscoverCharacteristicsEventHandler(cy_stc_ble_disc_char_info_t *discCharInfo);
void Cy_BLE_GATTC_DiscoverCharDescriptorsEventHandler(cy_stc_ble_disc_descr_info_t *discDescrInfo);
void Cy_BLE_GATTC_GetCharRange(cy_stc_ble_disc_range_info_t *charRangeInfo);
void Cy_BLE_GATTC_IndicationEventHandler(cy_stc_ble_gattc_handle_value_ind_param_t *eventParam);

cy_en_ble_api_result_t Cy_BLE_GATTC_AddConnHandle(cy_stc_ble_conn_handle_t connHandle);
cy_en_ble_api_result_t Cy_BLE_GATTC_RemoveConnHandle(cy_stc_ble_conn_handle_t connHandle);
#endif /* CY_BLE_GATT_ROLE_CLIENT */



