ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gatt.h
/***************************************
* Variables with external linkage
***************************************/
/** \cond IGNORE */
#if (CY_BLE_GATT_ROLE_SERVER)
#if (CY_BLE_GATT_DB_CCCD_COUNT != 0u)
extern uint8_t cy_ble_attValuesCccdMultiple[CY_BLE_CONN_COUNT][CY_BLE_GATT_DB_CCCD_COUNT + CY_BLE_CCCD_CRC_BYTE];
#endif /* CY_BLE_GATT_DB_CCCD_COUNT != 0u */
#endif /* (CY_BLE_GATT_ROLE_SERVER) */

#endif /* CY_BLE_MODE_PROFILE */

/* Global structure to initialize Cy_BLE_Init */
extern cy_stc_ble_config_t cy_ble_config;
extern cy_stc_ble_config_t *cy_ble_configPtr;
/** \endcond */

#if (CY_BLE_MODE_PROFILE)


/***************************************
* API Constants
***************************************/

/**
 * \addtogroup group_ble_common_api_macros_gatt_uuid_services
 * @{
 */
 
/***************************************
* Universal Unique Identifier (UUID): BLE Services
***************************************/

/* Generic Access Profile */
#define CY_BLE_UUID_GAP_SERVICE                          (0x1800u)  /**< Generic Access Service UUID */
/* Generic Attribute Profile */
#define CY_BLE_UUID_GATT_SERVICE                         (0x1801u)  /**< Generic Attribute Service UUID */

/* UUID: BLE Other Services */
#define CY_BLE_UUID_IMMEDIATE_ALERT_SERVICE              (0x1802u)  /**< Immediate Alert Service UUID */
#define CY_BLE_UUID_LINK_LOSS_SERVICE                    (0x1803u)  /**< Link Loss Service UUID */
#define CY_BLE_UUID_TX_POWER_SERVICE                     (0x1804u)  /**< Tx Power Service UUID */
#define CY_BLE_UUID_CURRENT_TIME_SERVICE                 (0x1805u)  /**< Current Time Service UUID */
#define CY_BLE_UUID_REF_TIME_UPDATE_SERVICE              (0x1806u)  /**< Reference Time Update Service UUID */
#define CY_BLE_UUID_NEXT_DST_CHANGE_SERVICE              (0x1807u)  /**< Next DST Change Service UUID */
#define CY_BLE_UUID_GLUCOSE_SERVICE                      (0x1808u)  /**< Glucose Service UUID */
#define CY_BLE_UUID_HEALTH_THERMOMETER_SERVICE           (0x1809u)  /**< Health Thermometer Service UUID */
#define CY_BLE_UUID_DEVICE_INFO_SERVICE                  (0x180Au)  /**< Device Information Service UUID */
#define CY_BLE_UUID_NWA_SERVICE                          (0x180Bu)  /**< NWA Service UUID */
#define CY_BLE_UUID_WATCH_DOG_SERVICE                    (0x180Cu)  /**< WATCH DOG Service UUID */
#define CY_BLE_UUID_HEART_RATE_SERVICE                   (0x180Du)  /**< Heart Rate Service UUID */
#define CY_BLE_UUID_PHONE_ALERT_STATUS_SERVICE           (0x180Eu)  /**< Phone Alert Status Service UUID */
#define CY_BLE_UUID_BAS_SERVICE                          (0x180Fu)  /**< Battery Service Service UUID */
#define CY_BLE_UUID_BLOOD_PRESSURE_SERVICE               (0x1810u)  /**< Blood Pressure Service UUID */
#define CY_BLE_UUID_ALERT_NOTIFICATION_SERVICE           (0x1811u)  /**< Alert Notification Service Service UUID */
#define CY_BLE_UUID_HIDS_SERVICE                         (0x1812u)  /**< Human Interface Device Service UUID */
#define CY_BLE_UUID_SCAN_PARAM_SERVICE                   (0x1813u)  /**< Scan Parameters Service UUID */
#define CY_BLE_UUID_RUNNING_SPEED_AND_CADENCE_SERVICE    (0x1814u)  /**< Running Speed and Cadence Service UUID */
#define CY_BLE_UUID_AUTOMATION_INPUT_OUTPUT_SERVICE      (0x1815u)  /**< Automation IO Service UUID */
#define CY_BLE_UUID_CYCLING_SPEED_AND_CADENCE_SERVICE    (0x1816u)  /**< Cycling Speed and Cadence Service UUID */
#define CY_BLE_UUID_CPS_SERVICE                          (0x1818u)  /**< Cycling Power Service UUID */
#define CY_BLE_UUID_LOCATION_AND_NAVIGATION_SERVICE      (0x1819u)  /**< Location and Navigation Service UUID */
#define CY_BLE_UUID_ENVIRONMENTAL_SENSING_SERVICE        (0x181Au)  /**< Environmental Sensing Service UUID */
#define CY_BLE_UUID_BODY_COMPOSITION_SERVICE             (0x181Bu)  /**< Body Composition Service UUID */
#define CY_BLE_UUID_USER_DATA_SERVICE                    (0x181Cu)  /**< User Data Service UUID */
#define CY_BLE_UUID_WEIGHT_SCALE_SERVICE                 (0x181Du)  /**< Weight Scale Service UUID */
#define CY_BLE_UUID_BOND_MANAGEMENT_SERVICE              (0x181Eu)  /**< Bond Management Service UUID */
#define CY_BLE_UUID_CGM_SERVICE                          (0x181Fu)  /**< Continuous Glucose Monitoring Service UUID */
#define CY_BLE_UUID_INTERNET_PROTOCOL_SUPPORT_SERVICE    (0x1820u)  /**< Internet Protocol Support Service UUID */
#define CY_BLE_UUID_IPS_SERVICE                          (0x1821u)  /**< Indoor Positioning Service UUID */
#define CY_BLE_UUID_PULSE_OXIMETER_SERVICE               (0x1822u)  /**< Pulse Oximeter Service UUID */
#define CY_BLE_UUID_HTTP_PROXY_SERVICE                   (0x1823u)  /**< HTTP Proxy Service UUID */
#define CY_BLE_UUID_WIRELESS_POWER_TRANSFER_SERVICE      (0xFFFEu)  /**< WIRELESS POWER TRANSFER Service UUID */
/** @} group_ble_common_api_macros_gatt_uuid_char_services */


/***************************************
* UUID: GATT Attribute Types defined by GATT Profile
***************************************/
/**
 * \addtogroup group_ble_common_api_macros_gatt_uuid_char_gatt_type
 * @{
 */
 
/** Primary Service Declaration */
#define CY_BLE_UUID_PRIMARY_SERVICE      (0x2800u)
/** Secondary Service Declaration */
#define CY_BLE_UUID_SECONDARY_SERVICE    (0x2801u)
/** Include Declaration */
#define CY_BLE_UUID_INCLUDE              (0x2802u)
/** Characteristic Declaration */
#define CY_BLE_UUID_CHARACTERISTIC       (0x2803u)

/** @} group_ble_common_api_macros_gatt_uuid_char_gatt_type */


/***************************************
* UUID: GATT Characteristic Descriptors
***************************************/
/**
 * \addtogroup group_ble_common_api_macros_gatt_uuid_char_desc
 * @{
 */
 
/** Characteristic Extended Properties */
#define CY_BLE_UUID_CHAR_EXTENDED_PROPERTIES      (0x2900u)
/** Characteristic User Description Descriptor */
#define CY_BLE_UUID_CHAR_USER_DESCRIPTION         (0x2901u)
/** Client Characteristic Configuration Descriptor */
#define CY_BLE_UUID_CHAR_CLIENT_CONFIG            (0x2902u)
/** Server Characteristic Configuration Descriptor */
#define CY_BLE_UUID_CHAR_SERVER_CONFIG            (0x2903u)
/** Characteristic Format Descriptor */
#define CY_BLE_UUID_CHAR_FORMAT                   (0x2904u)
/** Characteristic Aggregate Format Descriptor */
#define CY_BLE_UUID_CHAR_AGGREGATE_FORMAT         (0x2905u)
/** Characteristic Valid Range */
#define CY_BLE_UUID_CHAR_VALID_RANGE              (0x2906u)
/** External Report Reference */
#define CY_BLE_UUID_CHAR_EXTERNAL_REPORT_REF      (0x2907u)
/** Report Reference */
#define CY_BLE_UUID_CHAR_REPORT_REFERENCE         (0x2908u)
/** Number of Digitals */
#define CY_BLE_UUID_CHAR_NUMBER_OF_DIGITALS       (0x2909u)
/** Value Trigger Setting */
#define CY_BLE_UUID_CHAR_VALUE_TRIGGER_SETTING    (0x290Au)
/** Environmental Sensing Configuration */
#define CY_BLE_UUID_CHAR_ES_CONFIGURATION         (0x290Bu)
/** Environmental Sensing Measurement */
#define CY_BLE_UUID_CHAR_ES_MEASUREMENT           (0x290Cu)
/** Environmental Sensing Trigger Setting */
#define CY_BLE_UUID_CHAR_ES_TRIGGER_SETTING       (0x290Du)
/** Time Trigger Setting */
#define CY_BLE_UUID_CHAR_TIME_TRIGGER_SETTING     (0x290Eu)

