ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gatt.h
/** @} group_ble_common_api_macros_gatt_uuid_char_desc */

/***************************************
* UUID: Commonly used GATT Characteristic Types
***************************************/
/**
 * \addtogroup group_ble_common_api_macros_gatt_uuid_char_type
 * @{
 */
 
/** Device Name Characteristic */
#define CY_BLE_UUID_CHAR_DEVICE_NAME                     (0x2A00u)
/** Appearance Characteristic */
#define CY_BLE_UUID_CHAR_APPEARANCE                      (0x2A01u)
/** Peripheral Privacy Flag Characteristic */
#define CY_BLE_UUID_CHAR_PERIPH_PRIVCY_FLAG              (0x2A02u)
/** Reconnection Address Characteristic */
#define CY_BLE_UUID_CHAR_RECONNECTION_ADDR               (0x2A03u)
/** Peripheral Preferred Connection Parameters Characteristic */
#define CY_BLE_UUID_CHAR_PRFRRD_CNXN_PARAM               (0x2A04u)
/** Service Changed Characteristic */
#define CY_BLE_UUID_CHAR_SERVICE_CHANGED                 (0x2A05u)
/** Central Address Resolution Characteristic */
#define CY_BLE_UUID_CHAR_CENTRAL_ADDRESS_RESOLUTION      (0x2AA6u)
/** Resolvable Private Address Only characteristic */
#define CY_BLE_UUID_CHAR_RESOLVABLE_PRIVATE_ADDR_ONLY    (0x2AC9u)


/***************************************
* UUID: Other Characteristic Types
***************************************/

#define CY_BLE_UUID_CHAR_ALERT_LEVEL                     (0x2A06u) /**< Alert Level GATT Characteristic UUID*/
#define CY_BLE_UUID_CHAR_TX_POWER_LEVEL                  (0x2A07u) /**< Tx Power Level GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_DATE_TIME                       (0x2A08u) /**< Date Time GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_DAY_OF_WEEK                     (0x2A09u) /**< Day of Week GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_DAY_DATE_TIME                   (0x2A0Au) /**< Day Date Time GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_EXACT_TIME_100                  (0x2A0Bu) /**< Exact Time 100 GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_EXACT_TIME_256                  (0x2A0Cu) /**< Exact Time 256 GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_DST_OFFSET                      (0x2A0Du) /**< DST Offset GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_TIME_ZONE                       (0x2A0Eu) /**< Time Zone GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_LOCAL_TIME_INFO                 (0x2A0Fu) /**< Local Time Information GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_SEC_TIME_ZONE                   (0x2A10u) /**< Sec Time Zone GATT Characteristic UUID  */
#define CY_BLE_UUID_CHAR_TIME_WITH_DST                   (0x2A11u) /**< Time with DST GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_TIME_ACCURACY                   (0x2A12u) /**< Time Accuracy GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_TIME_SOURCE                     (0x2A13u) /**< Time Source GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_REF_TIME_INFO                   (0x2A14u) /**< Reference Time Information GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_TIME_BROADCAST                  (0x2A15u) /**< Time Broadcast GATT Characteristic UUID*/
#define CY_BLE_UUID_CHAR_TIME_UPDATE_CONTROL_POINT       (0x2A16u) /**< Time Update Control Point GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_TIME_UPDATE_STATE               (0x2A17u) /**< Time Update State GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_GLUCOSE_MSRMNT                  (0x2A18u) /**< Glucose Measurement GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_BATTERY_LEVEL                   (0x2A19u) /**< Battery Level GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_TEMPERATURE_MSMNT               (0x2A1Cu) /**< Temperature Measurement GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_TEMPERATURE_TYPE                (0x2A1Du) /**< Temperature Type GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_INTERMEDIATE_TEMP               (0x2A1Eu) /**< Intermediate Temperature GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_MSMNT_INTERVAL                  (0x2A21u) /**< Measurement Interval GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_HIDS_BOOT_KEYBOARD_IN_RPT       (0x2A22u) /**< Boot Keyboard Input Report GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_SYSTEM_ID                       (0x2A23u) /**< System ID GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_MODEL_NUMBER                    (0x2A24u) /**< Model Number String GATT Characteristic UUID */
#define CY_BLE_UUID_CHAR_SERIAL_NUMBER                   (0x2A25u) /**< Serial Number String Characteristic UUID */
#define CY_BLE_UUID_CHAR_FIRMWARE_REV                    (0x2A26u) /**< Firmware Revision String Characteristic UUID */
#define CY_BLE_UUID_CHAR_HARDWARE_REV                    (0x2A27u) /**< Hardware Revision String Characteristic UUID */
#define CY_BLE_UUID_CHAR_SOFTWARE_REV                    (0x2A28u) /**< Software Revision String Characteristic UUID */
#define CY_BLE_UUID_CHAR_MANUFACTURER_NAME               (0x2A29u) /**< Manufacturer Name String Characteristic UUID */
#define CY_BLE_UUID_CHAR_REG_CERT_DATA                   (0x2A2Au) /**< IEEE 11073-20601 Regulatory Certification Data List */
#define CY_BLE_UUID_CHAR_CURRENT_TIME                    (0x2A2Bu) /**< Current Time Characteristic UUID */
#define CY_BLE_UUID_CHAR_MAGNETIC_DECLINATION            (0x2A2Cu) /**< Magnetic Declination Characteristic UUID */
#define CY_BLE_UUID_CHAR_SCAN_REFRESH                    (0x2A31u) /**< Scan Refresh Characteristic UUID */
#define CY_BLE_UUID_CHAR_HIDS_BOOT_KEYBOARD_OUT_RPT      (0x2A32u) /**< Boot Keyboard Output Report Characteristic UUID */
#define CY_BLE_UUID_CHAR_HIDS_BOOT_MOUSE_IN_RPT          (0x2A33u) /**< Boot Mouse Input Report Characteristic UUID */
#define CY_BLE_UUID_CHAR_GL_MSRMT_CTX                    (0x2A34u) /**< Glucose Measurement Context UUID */
#define CY_BLE_UUID_CHAR_BP_MSRMT                        (0x2A35u) /**< Blood Pressure Measurement Characteristic UUID */
#define CY_BLE_UUID_CHAR_INTRMDT_CUFF_PRSR               (0x2A36u) /**< Intermediate Cuff Pressure Characteristic UUID */
#define CY_BLE_UUID_CHAR_HR_MSRMT                        (0x2A37u) /**< Heart Rate Measurement Characteristic UUID */
#define CY_BLE_UUID_CHAR_BODY_SENSOR_LOC                 (0x2A38u) /**< Body Sensor Location Characteristic UUID */
#define CY_BLE_UUID_CHAR_HR_CNTRL_POINT                  (0x2A39u) /**< Heart Rate Control Point Characteristic UUID */
#define CY_BLE_UUID_CHAR_NWA                             (0x2A3Eu) /**< NWA Characteristic UUID */
#define CY_BLE_UUID_CHAR_ALERT_STATUS                    (0x2A3Fu) /**< Alert Status Characteristic UUID */
#define CY_BLE_UUID_CHAR_RINGER_CONTROL_POINT            (0x2A40u) /**< Ringer Control Point Characteristic UUID */
#define CY_BLE_UUID_CHAR_RINGER_SETTING                  (0x2A41u) /**< Ringer Setting Characteristic UUID */
#define CY_BLE_UUID_CHAR_ALERT_ID_BIT_MASK               (0x2A42u) /**< Alert Category ID Bit Mask Characteristic UUID */
#define CY_BLE_UUID_CHAR_ALERT_ID                        (0x2A43u) /**< Alert Category ID Characteristic UUID */
#define CY_BLE_UUID_CHAR_ALERT_NTF_CONTROL_POINT         (0x2A44u) /**< Alert Notification Control Point Characteristic UUID */
#define CY_BLE_UUID_CHAR_UNREAD_ALRT_STATUS              (0x2A45u) /**< Unread Alert Status Characteristic UUID */
#define CY_BLE_UUID_CHAR_NEW_ALERT                       (0x2A46u) /**< New Alert Characteristic UUID */
#define CY_BLE_UUID_CHAR_SPRTD_NEW_ALRT_CTGRY            (0x2A47u) /**< Supported New Alert Category Characteristic UUID */
#define CY_BLE_UUID_CHAR_SPRT_UNRD_ALRT_CTGRY            (0x2A48u) /**< Supported Unread Alert Category Characteristic UUID */
#define CY_BLE_UUID_CHAR_BP_FEATURE                      (0x2A49u) /**< Blood Pressure Feature Characteristic UUID */
#define CY_BLE_UUID_CHAR_HIDS_INFORMATION                (0x2A4Au) /**< HID Information Characteristic UUID */
#define CY_BLE_UUID_CHAR_HIDS_REPORT_MAP                 (0x2A4Bu) /**< Report Map Characteristic UUID */
#define CY_BLE_UUID_CHAR_HIDS_CONTROL_POINT              (0x2A4Cu) /**< HID Control Point Characteristic UUID */
#define CY_BLE_UUID_CHAR_HIDS_REPORT                     (0x2A4Du) /**< Report Characteristic UUID */
#define CY_BLE_UUID_CHAR_HIDS_PROTOCOL_MODE              (0x2A4Eu) /**< Protocol Mode Characteristic UUID */
#define CY_BLE_UUID_CHAR_SCAN_WINDOW                     (0x2A4Fu) /**< Scan Interval Window Characteristic UUID */
#define CY_BLE_UUID_CHAR_PNP_ID                          (0x2A50u) /**< PnP ID Characteristic UUID */
#define CY_BLE_UUID_CHAR_GL_FEATURE                      (0x2A51u) /**< Glucose Feature Characteristic UUID */
#define CY_BLE_UUID_CHAR_RACP                            (0x2A52u) /**< Record Access Control Point Characteristic UUID */
#define CY_BLE_UUID_CHAR_RSC_MSRMT                       (0x2A53u) /**< RSC Measurement Characteristic UUID */
#define CY_BLE_UUID_CHAR_RSC_FEATURE                     (0x2A54u) /**< RSC Feature Characteristic UUID */
#define CY_BLE_UUID_CHAR_SC_CONTROL_POINT                (0x2A55u) /**< SC Control Point Characteristic UUID */
#define CY_BLE_UUID_CHAR_DIGITAL                         (0x2A56u) /**< Digital Characteristic UUID */
#define CY_BLE_UUID_CHAR_ANALOG                          (0x2A58u) /**< Analog Characteristic UUID */
#define CY_BLE_UUID_CHAR_AGGREGATE                       (0x2A5Au) /**< Aggregate Characteristic UUID */
#define CY_BLE_UUID_CHAR_CSC_MSRMT                       (0x2A5Bu) /**< CSC Measurement Characteristic UUID */
#define CY_BLE_UUID_CHAR_CSC_FEATURE                     (0x2A5Cu) /**< CSC Feature Characteristic UUID */
#define CY_BLE_UUID_CHAR_SENSOR_LOCATION                 (0x2A5Du) /**< Sensor Location Characteristic UUID */
#define CY_BLE_UUID_CHAR_CPS_MSRMT                       (0x2A63u) /**< Cycling Power Measurement Characteristic UUID */
#define CY_BLE_UUID_CHAR_CPS_VECTOR                      (0x2A64u) /**< Cycling Power Vector Characteristic UUID */
#define CY_BLE_UUID_CHAR_CPS_FEATURE                     (0x2A65u) /**< Cycling Power Feature Characteristic UUID */
#define CY_BLE_UUID_CHAR_CPS_CP                          (0x2A66u) /**< Cycling Power Control Point Characteristic UUID */
#define CY_BLE_UUID_CHAR_LOCATION_AND_SPEED              (0x2A67u) /**< Location and Speed Characteristic UUID */
#define CY_BLE_UUID_CHAR_NAVIGATION                      (0x2A68u) /**< Navigation Characteristic UUID */
#define CY_BLE_UUID_CHAR_POSITION_QUALITY                (0x2A69u) /**< Position Quality Characteristic UUID */
#define CY_BLE_UUID_CHAR_LN_FEATURE                      (0x2A6Au) /**< LN Feature Characteristic UUID */
#define CY_BLE_UUID_CHAR_LN_CONTROL_POINT                (0x2A6Bu) /**< LN Control Point Characteristic UUID */
#define CY_BLE_UUID_CHAR_ELEVATION                       (0x2A6Cu) /**< Elevation Characteristic UUID */
#define CY_BLE_UUID_CHAR_PRESSURE                        (0x2A6Du) /**< Pressure Characteristic UUID */
#define CY_BLE_UUID_CHAR_THEMPERATURE                    (0x2A6Eu) /**< Temperature Characteristic UUID */
#define CY_BLE_UUID_CHAR_HUMIDITY                        (0x2A6Fu) /**< Humidity Characteristic UUID */
#define CY_BLE_UUID_CHAR_TRUE_WIND_SPEED                 (0x2A70u) /**< True Wind Speed Characteristic UUID */
#define CY_BLE_UUID_CHAR_TRUE_WIND_DIRECTION             (0x2A71u) /**< True Wind Direction Characteristic UUID */
#define CY_BLE_UUID_CHAR_APPARENT_WIND_SPEED             (0x2A72u) /**< Apparent Wind Speed Characteristic UUID */
#define CY_BLE_UUID_CHAR_APPARENT_WIND_DIRECTION         (0x2A73u) /**< Apparent Wind Direction Characteristic UUID */
#define CY_BLE_UUID_CHAR_GUST_FACTOR                     (0x2A74u) /**< Gust Factor Characteristic UUID */
#define CY_BLE_UUID_CHAR_POLLEN_CONCENTRATION            (0x2A75u) /**< Pollen Concentration Characteristic UUID */
#define CY_BLE_UUID_CHAR_UV_INDEX                        (0x2A76u) /**< UV Index Characteristic UUID */
#define CY_BLE_UUID_CHAR_IRRADIANCE                      (0x2A77u) /**< Irradiance Characteristic UUID */
#define CY_BLE_UUID_CHAR_RAINFALL                        (0x2A78u) /**< Rainfall Characteristic UUID */
#define CY_BLE_UUID_CHAR_WIND_CHILL                      (0x2A79u) /**< Wind Chill Characteristic UUID */
#define CY_BLE_UUID_CHAR_HEAT_INDEX                      (0x2A7Au) /**< Aerobic Heart Rate Lower Limit Characteristic UUID */
#define CY_BLE_UUID_CHAR_DEW_POINT                       (0x2A7Bu) /**< Dew Point Characteristic UUID */
#define CY_BLE_UUID_CHAR_DESCR_VALUE_CHANGED             (0x2A7Du) /**< Descriptor Value Changed Characteristic UUID */
#define CY_BLE_UUID_CHAR_AEL                             (0x2A7Eu) /**< Aerobic Heart Rate Lower Limit Characteristic UUID */
#define CY_BLE_UUID_CHAR_AEROBIC_THRESHOLD               (0x2A7Fu) /**< Aerobic Threshold Feature Characteristic UUID */
#define CY_BLE_UUID_CHAR_AGE                             (0x2A80u) /**< Age Feature Characteristic UUID */
#define CY_BLE_UUID_CHAR_ANL                             (0x2A81u) /**< Anaerobic Heart Rate Lower Limit Char. UUID */
#define CY_BLE_UUID_CHAR_ANU                             (0x2A82u) /**< Anaerobic Heart Rate Upper Limit Char. UUID */
#define CY_BLE_UUID_CHAR_ANAEROBIC_THRESHOLD             (0x2A83u) /**< Anaerobic Threshold Characteristic UUID */
#define CY_BLE_UUID_CHAR_AEU                             (0x2A84u) /**< Aerobic Heart Rate Upper Limit Char. UUID */
#define CY_BLE_UUID_CHAR_DATE_OF_BIRTH                   (0x2A85u) /**< Date of Birth Feature Characteristic UUID */
#define CY_BLE_UUID_CHAR_DATE_OF_THRESHOLD_ASSESSMENT    (0x2A86u) /**< Date of Threshold Assessment Char. UUID */
#define CY_BLE_UUID_CHAR_EMAIL_ADDRESS                   (0x2A87u) /**< Email Address Characteristic UUID */
#define CY_BLE_UUID_CHAR_FBL                             (0x2A88u) /**< Fat Burn Heart Rate Lower Limit Char. UUID */
#define CY_BLE_UUID_CHAR_FBU                             (0x2A89u) /**< Fat Burn Heart Rate Upper Limit Char. UUID */
#define CY_BLE_UUID_CHAR_FIRST_NAME                      (0x2A8Au) /**< First Name Characteristic UUID */
#define CY_BLE_UUID_CHAR_FIVE_ZONE_HEART_RATE_LIMITS     (0x2A8Bu) /**< Five Zone Heart Rate Limits Char. UUID */
#define CY_BLE_UUID_CHAR_GENDER                          (0x2A8Cu) /**< Gender  Characteristic UUID */
#define CY_BLE_UUID_CHAR_HEART_RATE_MAX                  (0x2A8Du) /**< Heart Rate Max Feature Characteristic UUID */
#define CY_BLE_UUID_CHAR_HEIGHT                          (0x2A8Eu) /**< Height Characteristic UUID */
#define CY_BLE_UUID_CHAR_HIP_CIRCUNFERENCE               (0x2A8Fu) /**< Hip Circumference Characteristic UUID */
#define CY_BLE_UUID_CHAR_LAST_NAME                       (0x2A90u) /**< Last Name Characteristic UUID */
#define CY_BLE_UUID_CHAR_MRH                             (0x2A91u) /**< Maximum Recommended Heart Rate Characteristic UUID */
#define CY_BLE_UUID_CHAR_RESTING_HEART_RATE              (0x2A92u) /**< Resting Heart Rate Characteristic UUID */
#define CY_BLE_UUID_CHAR_STP                             (0x2A93u) /**< Sport Type for Aerobic and Anaerobic Thresholds */
#define CY_BLE_UUID_CHAR_THREE_ZONE_HEART_RATE_LIMITS    (0x2A94u) /**< Three Zone Heart Rate Limits Characteristic UUID */
#define CY_BLE_UUID_CHAR_TWO_ZONE_HEART_RATE_LIMIT       (0x2A95u) /**< Two Zone Heart Rate Limit Characteristic UUID */
#define CY_BLE_UUID_CHAR_VO2_MAX                         (0x2A96u) /**< VO2 Max Characteristic UUID */
#define CY_BLE_UUID_CHAR_WAIST_CIRCUMFERENCE             (0x2A97u) /**< Waist Circumference Characteristic UUID */
#define CY_BLE_UUID_CHAR_WEIGHT                          (0x2A98u) /**< Weight Characteristic UUID */
#define CY_BLE_UUID_CHAR_DATABASE_CHANGE_INCREMENT       (0x2A99u) /**< Database Change Increment Characteristic UUID */
#define CY_BLE_UUID_CHAR_USER_INDEX                      (0x2A9Au) /**< User Index Characteristic UUID */
#define CY_BLE_UUID_CHAR_BODY_COMPOSITION_FEATURE        (0x2A9Bu) /**< Body Composition Feature Characteristic UUID */
#define CY_BLE_UUID_CHAR_BODY_COMPOSITION_MEASUREMENT    (0x2A9Cu) /**< Body Composition Measurement Characteristic UUID */
#define CY_BLE_UUID_CHAR_WEIGHT_MEASUREMENT              (0x2A9Du) /**< Weight Measurement Characteristic UUID */
#define CY_BLE_UUID_CHAR_WEIGHT_SCALE_FEATURE            (0x2A9Eu) /**< Weight Scale Feature Characteristic UUID */
#define CY_BLE_UUID_CHAR_USER_CONTROL_POINT              (0x2A9Fu) /**< User Control Point Characteristic UUID */
#define CY_BLE_UUID_CHAR_MAGNETIC_FLUX_DENSITY_2D        (0x2AA0u) /**< Magnetic Flux Density - 2D Characteristic UUID */
#define CY_BLE_UUID_CHAR_MAGNETIC_FLUX_DENSITY_3D        (0x2AA1u) /**< Magnetic Flux Density - 3D Characteristic UUID */
#define CY_BLE_UUID_CHAR_LANGUAGE                        (0x2AA2u) /**< Language Characteristic UUID */
#define CY_BLE_UUID_CHAR_BAR_PRESSURE_TREND              (0x2AA3u) /**< Barometric Pressure Trend Characteristic UUID */
/* Bond Management Characteristics defines */
#define CY_BLE_UUID_BOND_MANAGEMENT_CONTROL_POINT        (0x2AA4u) /**< Bond Management Control Point Characteristic UUID */
#define CY_BLE_UUID_BOND_MANAGEMENT_FEATURE              (0x2AA5u) /**< Bond Management Feature Characteristic UUID */
/* CGM Characteristics defines */
#define CY_BLE_UUID_CHAR_CGM_MEASUREMENT                 (0x2AA7u) /**< CGM Measurement Characteristic UUID */
#define CY_BLE_UUID_CHAR_CGM_FEATURE                     (0x2AA8u) /**< CGM Feature Characteristic UUID */
#define CY_BLE_UUID_CHAR_CGM_STATUS                      (0x2AA9u) /**< CGM Status Characteristic UUID */
#define CY_BLE_UUID_CHAR_CGM_SESSION_START_TIME          (0x2AAAu) /**< CGM Session Start Time Characteristic UUID */
#define CY_BLE_UUID_CHAR_CGM_SESSION_RUN_TIME            (0x2AABu) /**< CGM Session Run Time Characteristic UUID */
#define CY_BLE_UUID_CHAR_CGM_SOCP                        (0x2AACu) /**< CGM Specific Ops Control Point Characteristic UUID */
/* Pulse Oximeter Characteristics defines */
#define CY_BLE_UUID_CHAR_PLX_SPOT_CHK_MSRMT              (0x2A5Eu) /**< PLX Spot-Check Measurement Characteristic UUID */
#define CY_BLE_UUID_CHAR_PLX_CONTINUOUS_MSRMT            (0x2A5Fu) /**< PLX Continuous Measurement Characteristic UUID */
#define CY_BLE_UUID_CHAR_PLX_FEATURES                    (0x2A60u) /**< PLX Features Characteristic UUID */
/* CPM Characteristics Measurements */
#define CY_BLE_UUID_CHAR_CPM_MSRMT                       (0x2A63u) /**< Cycling Power Measurement Characteristic UUID */
#define CY_BLE_UUID_CHAR_CPM_VECTOR                      (0x2A64u) /**< Cycling Power Vector Characteristic UUID */
#define CY_BLE_UUID_CHAR_CPM_FEATURE                     (0x2A65u) /**< Cycling Power Feature Characteristic UUID */
#define CY_BLE_UUID_CHAR_CPM_CNTRL_PNT                   (0x2A66u) /**< Cycling Power Control Point Characteristic UUID */
/* IPS Characteristics defines */
#define CY_BLE_UUID_CHAR_INDOOR_POSITINING_CONFIG        (0x2AADu) /**< Indoor Positioning Configuration Char. UUID */
#define CY_BLE_UUID_CHAR_LATITUDE                        (0x2AAEu) /**< Latitude Characteristic UUID */
#define CY_BLE_UUID_CHAR_LONGITUDE                       (0x2AAFu) /**< Longitude Characteristic UUID */
#define CY_BLE_UUID_CHAR_LOCAL_NORTH_COORDINATE          (0x2AB0u) /**< Local North Coordinate Characteristic UUID */
#define CY_BLE_UUID_CHAR_LOCAL_EAST_COORDINATE           (0x2AB1u) /**< Local East Coordinate Characteristic UUID */
#define CY_BLE_UUID_CHAR_FLOOR_NUMBER                    (0x2AB2u) /**< Floor Number Characteristic UUID */
#define CY_BLE_UUID_CHAR_ALTITUDE                        (0x2AB3u) /**< Altitude Characteristic UUID */
#define CY_BLE_UUID_CHAR_UNCERTAINTY                     (0x2AB4u) /**< Uncertainty Characteristic UUID */
#define CY_BLE_UUID_CHAR_LOCATION_NAME                   (0x2AB5u) /**< Location Name Characteristic UUID */
/* HPS Characteristics defines */
#define CY_BLE_UUID_CHAR_URI                             (0x2AB6u) /**< URI Characteristic UUID */
#define CY_BLE_UUID_CHAR_HTTP_HEADERS                    (0x2AB7u) /**< HTTP Headers Characteristic UUID */
#define CY_BLE_UUID_CHAR_HTTP_ENTITY_BODY                (0x2AB9u) /**< HTTP Entity Body Characteristic UUID */
#define CY_BLE_UUID_CHAR_HTTP_CP                         (0x2ABAu) /**< HTTP Control Point Characteristic UUID */
#define CY_BLE_UUID_CHAR_HTTP_STATUS_CODE                (0x2AB8u) /**< HTTP Status Code Characteristic UUID */
#define CY_BLE_UUID_CHAR_HTTPS_SECURITY                  (0x2ABBu) /**< HTTPS Security Characteristic UUID */

/** @} group_ble_common_api_macros_gatt_uuid_char_type */

/**
 * \addtogroup group_ble_common_api_macros
 * @{
 */
 
/* GATT Characteristic Properties bit field */
#define CY_BLE_CHAR_PROP_BROADCAST                       (0x01u)   /**< Broadcast */
#define CY_BLE_CHAR_PROP_READ                            (0x02u)   /**< Read */
#define CY_BLE_CHAR_PROP_WRITE_WITHOUT_RSP               (0x04u)   /**< Write Without Response */
#define CY_BLE_CHAR_PROP_WRITE                           (0x08u)   /**< Write */
#define CY_BLE_CHAR_PROP_NOTIFY                          (0x10u)   /**< Notify */
#define CY_BLE_CHAR_PROP_INDICATE                        (0x20u)   /**< Indicate */
#define CY_BLE_CHAR_PROP_SIGNED_WRITE                    (0x40u)   /**< Authenticated Signed Writes */
#define CY_BLE_CHAR_PROP_EXTENDED_PROPERTIES             (0x80u)   /**< Extended properties */

 
/* Client Characteristic Configuration Descriptor values */
#define CY_BLE_CCCD_DEFAULT                              (0x0000u) /**< Notifications and Indications disabled */
#define CY_BLE_CCCD_NOTIFICATION                         (0x0001u) /**< Notifications enabled */
#define CY_BLE_CCCD_INDICATION                           (0x0002u) /**< Indications enabled */
#define CY_BLE_CCCD_LEN                                  (0x02u)   /**< Length of CCCD desctiptor */

/* Server Characteristic Configuration Descriptor values */
#define CY_BLE_SCCD_DEFAULT                              (0x0000u) /**< Broadcasts disabled */
#define CY_BLE_SCCD_BROADCAST                            (0x0001u) /**< Broadcasts enabled */
#define CY_BLE_SCCD_LEN                                  (0x02u)   /**< Length of SCCD desctiptor */

