ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gatt.h
/* Characteristic Presentation Format Descriptor values */
#define CY_BLE_CPFD_BOOLEAN                              (0x01u)   /**< Unsigned 1-bit; 0=false, 1=true */
#define CY_BLE_CPFD_UINT2                                (0x02u)   /**< Unsigned 2-bit integer */
#define CY_BLE_CPFD_UINT4                                (0x03u)   /**< Unsigned 4-bit integer */
#define CY_BLE_CPFD_UINT8                                (0x04u)   /**< Unsigned 8-bit integer */
#define CY_BLE_CPFD_UINT12                               (0x05u)   /**< Unsigned 12-bit integer */
#define CY_BLE_CPFD_UINT16                               (0x06u)   /**< Unsigned 16-bit integer */
#define CY_BLE_CPFD_UINT24                               (0x07u)   /**< Unsigned 24-bit integer */
#define CY_BLE_CPFD_UINT32                               (0x08u)   /**< Unsigned 32-bit integer */
#define CY_BLE_CPFD_UINT48                               (0x09u)   /**< Unsigned 48-bit integer */
#define CY_BLE_CPFD_UINT64                               (0x0au)   /**< Unsigned 64-bit integer */
#define CY_BLE_CPFD_UINT128                              (0x0bu)   /**< Unsigned 128-bit integer */
#define CY_BLE_CPFD_INT8                                 (0x0cu)   /**< Signed 8-bit integer */
#define CY_BLE_CPFD_INT12                                (0x0du)   /**< Signed 12-bit integer */
#define CY_BLE_CPFD_INT16                                (0x0eu)   /**< Signed 16-bit integer */
#define CY_BLE_CPFD_INT24                                (0x0fu)   /**< Signed 24-bit integer */
#define CY_BLE_CPFD_INT32                                (0x10u)   /**< Signed 32-bit integer */
#define CY_BLE_CPFD_INT48                                (0x11u)   /**< Signed 48-bit integer */
#define CY_BLE_CPFD_INT64                                (0x12u)   /**< Signed 64-bit integer */
#define CY_BLE_CPFD_INT128                               (0x13u)   /**< Signed 128-bit integer */
#define CY_BLE_CPFD_IEEE754_FP32                         (0x14u)   /**< IEEE-754 32-bit floating point */
#define CY_BLE_CPFD_IEEE754_FP64                         (0x15u)   /**< IEEE-754 64-bit floating point */
#define CY_BLE_CPFD_IEEE11073_SFLOAT16                   (0x16u)   /**< IEEE-11073 16-bit SFLOAT */
#define CY_BLE_CPFD_IEEE11073_FLOAT32                    (0x17u)   /**< IEEE-11073 32-bit FLOAT */
#define CY_BLE_CPFD_IEEE20601_FORMAT                     (0x18u)   /**< IEEE-20601 format */
#define CY_BLE_CPFD_UTF8_STRING                          (0x19u)   /**< UTF-8 string */
#define CY_BLE_CPFD_UTF16_STRING                         (0x1au)   /**< UTF-16 string */
#define CY_BLE_CPFD_OPAQUE_STRUCTURE                     (0x1bu)   /**< Opaque structure */
#define CY_BLE_CPFD_LEN                                  (0x01u)   /**< Length of CPFD desctiptor */

/* Characteristic Extended Properties Descriptor values */
#define CY_BLE_CEPD_DEFAULT                              (0x0000u) /**< Writable Auxiliaries & Reliable Write disabled */
#define CY_BLE_CEPD_RELIABLE_WRITE                       (0x0001u) /**< Reliable Write enabled */
#define CY_BLE_CEPD_WRITABLE_AUXILIARIES                 (0x0002u) /**< Writable Auxiliaries enabled */
#define CY_BLE_CEPD_LEN                                  (0x02u)   /**< Length of CEPD desctiptor */

#define CY_BLE_DB_ATTR_HANDLE_LEN                        (0x02u)   /**< Length of DB ATTR HANDLE */

/* PDU data length */
#define CY_BLE_PDU_DATA_LEN_ZERO                         (0x00u)   /**< Zero */
#define CY_BLE_PDU_DATA_LEN_ONE_BYTE                     (0x01u)   /**< PDU len: 1 byte  */
#define CY_BLE_PDU_DATA_LEN_TWO_BYTES                    (0x02u)   /**< PDU len: 2 bytes */
#define CY_BLE_PDU_DATA_LEN_THREE_BYTES                  (0x03u)   /**< PDU len: 3 bytes */
#define CY_BLE_PDU_DATA_LEN_FOUR_BYTES                   (0x04u)   /**< PDU len: 4 bytes */
#define CY_BLE_PDU_DATA_LEN_FIVE_BYTES                   (0x05u)   /**< PDU len: 5 bytes */
#define CY_BLE_PDU_DATA_LEN_SIX_BYTES                    (0x06u)   /**< PDU len: 6 bytes */
#define CY_BLE_PDU_DATA_LEN_SEVEN_BYTES                  (0x07u)   /**< PDU len: 7 bytes */
#define CY_BLE_PDU_DATA_LEN_EIGHT_BYTES                  (0x08u)   /**< PDU len: 8 bytes */
#define CY_BLE_PDU_DATA_LEN_NINE_BYTES                   (0x09u)   /**< PDU len: 9 bytes */

/* Peripheral Preferred Connection Parameters Characteristic values */
#define CY_BLE_PPCPC_MIN_CONN_INTV_OFFSET                (0x00u)    /**< Offset of Minimum Connection Interval Field */
#define CY_BLE_PPCPC_MAX_CONN_INTV_OFFSET                (0x02u)    /**< Offset of Maximum Connection Interval Field */
#define CY_BLE_PPCPC_SLAVE_LATENCY_OFFSET                (0x04u)    /**< Offset of Slave Latency Field */
#define CY_BLE_PPCPC_SUP_TIMEOUT_OFFSET                  (0x06u)    /**< Offset of Connection Supervision Timeout Field */
#define CY_BLE_PPCPC_LEN                                 (0x08u)    /**< Length of PPCPC desctiptor */
/** @} group_ble_common_api_macros */

/***************************************
* Bluetooth Appearance values
***************************************/
/**
 * \addtogroup group_ble_common_api_macros_appearance_values
 * @{
 */
 
#define CY_BLE_APPEARANCE_UNKNOWN                              (0u)    /**< Unknown */
#define CY_BLE_APPEARANCE_GENERIC_PHONE                        (64u)   /**< Generic Phone */
#define CY_BLE_APPEARANCE_GENERIC_COMPUTER                     (128u)  /**< Generic Computer */
#define CY_BLE_APPEARANCE_GENERIC_WATCH                        (192u)  /**< Generic Watch */
#define CY_BLE_APPEARANCE_WATCH_SPORTS_WATCH                   (193u)  /**< Watch: Sports Watch */
#define CY_BLE_APPEARANCE_GENERIC_CLOCK                        (256u)  /**< Generic Clock */
#define CY_BLE_APPEARANCE_GENERIC_DISPLAY                      (320u)  /**< Generic Display */
#define CY_BLE_APPEARANCE_GENERIC_REMOTE_CONTROL               (384u)  /**< Generic Remote Control */
#define CY_BLE_APPEARANCE_GENERIC_EYE_GLASSES                  (448u)  /**< Generic Eye-glasses */
#define CY_BLE_APPEARANCE_GENERIC_TAG                          (512u)  /**< Generic Tag */
#define CY_BLE_APPEARANCE_GENERIC_KEYRING                      (576u)  /**< Generic Keyring */
#define CY_BLE_APPEARANCE_GENERIC_MEDIA_PLAYER                 (640u)  /**< Generic Media Player */
#define CY_BLE_APPEARANCE_GENERIC_BARCODE_SCANNER              (704u)  /**< Generic Barcode Scanner */
#define CY_BLE_APPEARANCE_GENERIC_THERMOMETER                  (768u)  /**< Generic Thermometer */
#define CY_BLE_APPEARANCE_THERMOMETER_EAR                      (769u)  /**< Thermometer: Ear */
#define CY_BLE_APPEARANCE_GENERIC_HEART_RATE_SENSOR            (832u)  /**< Generic Heart rate Sensor */
#define CY_BLE_APPEARANCE_HEART_RATE_SENSOR_HEART_RATE_BELT    (833u)  /**< Heart Rate Sensor: Heart Rate Belt */
#define CY_BLE_APPEARANCE_GENERIC_BLOOD_PRESSURE               (896u)  /**< Generic Glucose */
#define CY_BLE_APPEARANCE_BLOOD_PRESSURE_ARM                   (897u)  /**< Glucose: Arm */
#define CY_BLE_APPEARANCE_BLOOD_PRESSURE_WRIST                 (898u)  /**< Glucose: Wrist */
#define CY_BLE_APPEARANCE_GENERIC_HID                          (960u)  /**< Human Interface Device (HID) */
#define CY_BLE_APPEARANCE_HIDS_KEYBOARD                        (961u)  /**< Keyboard (HID Subtype) */
#define CY_BLE_APPEARANCE_HIDS_MOUSE                           (962u)  /**< Mouse (HID Subtype) */
#define CY_BLE_APPEARANCE_HIDS_JOYSTICK                        (963u)  /**< Joystiq (HID Subtype) */
#define CY_BLE_APPEARANCE_HIDS_GAMEPAD                         (964u)  /**< Gamepad (HID Subtype) */
#define CY_BLE_APPEARANCE_HIDS_DIGITIZERSUBTYPE                (965u)  /**< Digitizer Tablet (HID Subtype) */
#define CY_BLE_APPEARANCE_HIDS_CARD_READER                     (966u)  /**< Card Reader (HID Subtype) */
#define CY_BLE_APPEARANCE_HIDS_DIGITAL_PEN                     (967u)  /**< Digital Pen (HID Subtype) */
#define CY_BLE_APPEARANCE_HIDS_BARCODE                         (968u)  /**< Barcode Scanner (HID Subtype) */
#define CY_BLE_APPEARANCE_GENERIC_GLUCOSE_METER                (1024u) /**< Generic Glucose Meter */
#define CY_BLE_APPEARANCE_GENERIC_RUNNING_WALKING_SENSOR       (1088u) /**< Generic Running Walking Sensor */
#define CY_BLE_APPEARANCE_RUNNING_WALKING_SENSOR_IN_SHOE       (1089u) /**< Running Walking Sensor: In-Shoe */
#define CY_BLE_APPEARANCE_RUNNING_WALKING_SENSOR_ON_SHOE       (1090u) /**< Running Walking Sensor: On-Shoe */
#define CY_BLE_APPEARANCE_RUNNING_WALKING_SENSOR_ON_HIP        (1091u) /**< Running Walking Sensor: On-Hip */
#define CY_BLE_APPEARANCE_GENERIC_CYCLING                      (1152u) /**< Generic Cycling */
#define CY_BLE_APPEARANCE_CYCLING_CYCLING_COMPUTER             (1153u) /**< Cycling: Cycling Computer */
#define CY_BLE_APPEARANCE_CYCLING_SPEED_SENSOR                 (1154u) /**< Cycling: Speed Sensor */
#define CY_BLE_APPEARANCE_CYCLING_CADENCE_SENSOR               (1155u) /**< Cycling: Cadence Sensor */
#define CY_BLE_APPEARANCE_CYCLING_POWER_SENSOR                 (1156u) /**< Cycling: Power Sensor */
#define CY_BLE_APPEARANCE_CYCLING_SPEED_CADENCE_SENSOR         (1157u) /**< Cycling: Speed and Cadence Sensor */
/** @} group_ble_common_api_macros_appearance_values */


/**
 * \addtogroup group_ble_common_api_macros
 * @{
 */
 
