ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gatt.h
/***************************************
* SMP Key size constants
***************************************/

#define CY_BLE_SMP_USER_PASSKEY_SIZE    (6u)          /**< User Passkey size */
#define CY_BLE_SMP_IDADDR_SIZE          (7u)          /**< Identity Address data size */
#define CY_BLE_SMP_IRK_SIZE             (16u)         /**< Identity Resolving Key size */
#define CY_BLE_SMP_CSRK_SIZE            (16u)         /**< Connection Signature Resolving key size */
#define CY_BLE_SMP_LTK_SIZE             (16u)         /**< Long Term Key Size size */
#define CY_BLE_SMP_EDIV_SIZE            (2u)          /**< Encrypted Diversifier size */
#define CY_BLE_SMP_RAND_24B_SIZE        (3u)          /**< 24 Bit Random Number size */
#define CY_BLE_SMP_RAND_64B_SIZE        (8u)          /**< 64 Bit Random Number size */
#define CY_BLE_SMP_RAND_128B_SIZE       (16u)         /**< 128 Bit Random Number size */

#define CY_BLE_NULL_CHARCTER            ((char8)(0))  /**< Null charter */

/***************************************
* Common constants for LLS and IAS services
***************************************/
#define CY_BLE_NO_ALERT      (0u)                     /**< Alert Level: No Alert */
#define CY_BLE_MILD_ALERT    (1u)                     /**< Alert Level: Mild Alert */
#define CY_BLE_HIGH_ALERT    (2u)                     /**< Alert Level: High Alert */

/** @} group_ble_common_api_macros */

/***************************************
* Database macro
***************************************/
/**
 * \addtogroup group_ble_common_api_macros_gatt_db
 * @{
 */
 
/** Get permission field of attribute handle */
#define CY_BLE_GATT_DB_GET_ATTR_PERMISSION(handle) \
    (uint32_t)(cy_ble_configPtr->gattDB[(handle) - 1u].permission)

/** Compare permission field of attribute entry to
 *  check desired permission property
 */
#define CY_BLE_GATT_DB_ATTR_CHECK_PRPTY(handle, prpty) \
    ((0ul) != (CY_BLE_GATT_DB_GET_ATTR_PERMISSION(handle) & (prpty)))

/** Macro to set generic value of attribute */
#define CY_BLE_GATT_DB_ATTR_SET_GEN_VALUE(handle, src, length)                                                    \
    (void)memcpy                                                                                                  \
    (                                                                                                             \
        (void*)(cy_ble_configPtr->gattDB[(handle) - 1u].attValue.attFormatValue.attGenericValLen->attGenericVal), \
        (const void*)(src),                                                                                       \
        (uint16_t)(length)                                                                                        \
    )


/** Macro to get generic value of attribute. This macro also used to get
 *  UUID32 or UUID 128 of the attribute.
 */
#define CY_BLE_GATT_DB_ATTR_GET_GEN_VALUE(dst, handle, length)                                                          \
    (void)memcpy                                                                                                        \
    (                                                                                                                   \
        (void*)(dst),                                                                                                   \
        (const void*)(cy_ble_configPtr->gattDB[(handle) - 1u].attValue.attFormatValue.attGenericValLen->attGenericVal), \
        (uint16_t)(length)                                                                                              \
    )

/** Macro to get start handle of attribute
 *  Start handle is only meaningful for characteristic and
 *  service declaration */
#define CY_BLE_GATT_DB_GET_START_HANDLE(handle) \
    cy_ble_configPtr->gattDB[(handle) - 1u].attHandle

/** Macro to get end handle of attribute
 *  Start handle is only meaningful for characteristic and
 *  service declaration */
#define CY_BLE_GATT_DB_GET_END_HANDLE(handle) \
    cy_ble_configPtr->gattDB[(handle) - 1u].attEndHandle


/** Macro to get attribute type (UUID) for handle */
#define CY_BLE_GATT_DB_GET_UUID(handle) \
    cy_ble_configPtr->gattDB[(handle) - 1u].attType


/** Macro to get attribute value UUID for handle. This macro is only applicable
 *  to UUID16. To get UUID32 or UUID 128 use CY_BLE_GATT_DB_ATTR_GET_GEN_VALUE().
 */
#define CY_BLE_GATT_DB_GET_ATTR_VALUE_UUID(handle) \
    cy_ble_configPtr->gattDB[(handle) - 1u].attValue.attValueUuid

/** Macro to get actual length of characteristic generic value */
#define CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_LEN(handle) \
    cy_ble_configPtr->gattDB[(handle) - 1u].attValue.attFormatValue.attGenericValLen->actualLength

/** Macro to set actual length of characteristic generic value.
 *  Note that this macro doesn't validate the actual length, which can't be greater then maximum length.
 *  Use CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_MAX_LEN macro to read and validate maximum length.
 */
#define CY_BLE_GATT_DB_ATTR_SET_ATTR_GEN_LEN(handle, value)                                                       \
    do {                                                                                                          \
        cy_ble_configPtr->gattDB[(handle) - 1u].attValue.attFormatValue.attGenericValLen->actualLength = (value); \
    } while(0)

/** Macro to get maximum length of characteristic generic value */
#define CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_MAX_LEN(handle) \
    cy_ble_configPtr->gattDB[(handle) - 1u].attValue.attFormatValue.maxAttrLength

/** Macro to get index of CCCD value */
#define CY_BLE_GATT_DB_ATTR_GET_CCCD_IDX(handle)    (CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_PTR(handle) - \
                                                     cy_ble_configPtr->attValuesCCCD)

/** Macro to get pointer to characteristic generic value */
#define CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_PTR(handle) \
    (uint8_t*)(cy_ble_configPtr->gattDB[(handle) - 1u].attValue.attFormatValue.attGenericValLen->attGenericVal)

/** Macro to get pointer to CCCD value */
#define CY_BLE_GATT_DB_ATTR_GET_CCCD_ATTR_GEN_PTR(attId, handle) \
    (uint8_t*)(&cy_ble_attValuesCccdMultiple[attId][CY_BLE_GATT_DB_ATTR_GET_CCCD_IDX(handle)])

/** Checks Notification properties in permission field of attribute entry */
#define CY_BLE_IS_NOTIFICATION_SUPPORTED(handle) \
    CY_BLE_GATT_DB_ATTR_CHECK_PRPTY(handle, CY_BLE_GATT_DB_CH_PROP_NOTIFY)

/** Checks Notification bit in attribute value referenced by pointer */
#define CY_BLE_IS_NOTIFICATION_ENABLED_IN_PTR(valPtr) \
    ((0u) != (CY_BLE_CCCD_NOTIFICATION & Cy_BLE_Get16ByPtr(valPtr)))

