ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gatt.h
/** Checks Notification bit in attribute value referenced by handle */
#define CY_BLE_IS_NOTIFICATION_ENABLED(attId, handle) \
    CY_BLE_IS_NOTIFICATION_ENABLED_IN_PTR(CY_BLE_GATT_DB_ATTR_GET_CCCD_ATTR_GEN_PTR(attId, handle))

/** Checks Indication properties in permission field of attribute entry */
#define CY_BLE_IS_INDICATION_SUPPORTED(handle) \
    CY_BLE_GATT_DB_ATTR_CHECK_PRPTY(handle, CY_BLE_GATT_DB_CH_PROP_INDICATE)

/** Checks Indication bit in attribute value referenced by pointer */
#define CY_BLE_IS_INDICATION_ENABLED_IN_PTR(valPtr) \
    ((0u) != (CY_BLE_CCCD_INDICATION & Cy_BLE_Get16ByPtr(valPtr)))

/** Checks Indication bit in attribute value referenced by handle */
#define CY_BLE_IS_INDICATION_ENABLED(attId, handle) \
    CY_BLE_IS_INDICATION_ENABLED_IN_PTR(CY_BLE_GATT_DB_ATTR_GET_CCCD_ATTR_GEN_PTR(attId, handle))

/** Checks Broadcast properties in permission field of attribute entry */
#define CY_BLE_IS_BROADCAST_SUPPORTED(handle) \
    CY_BLE_GATT_DB_ATTR_CHECK_PRPTY(handle, CY_BLE_GATT_DB_CH_PROP_BROADCAST)

/** Checks Broadcast bit in attribute value referenced by pointer */
#define CY_BLE_IS_BROADCAST_ENABLED_IN_PTR(valPtr) \
    ((0u) != (CY_BLE_SCCD_BROADCAST & Cy_BLE_Get16ByPtr(valPtr)))

/** Checks Broadcast bit in attribute value referenced by handle */
#define CY_BLE_IS_BROADCAST_ENABLED(handle) \
    CY_BLE_IS_BROADCAST_ENABLED_IN_PTR(CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_PTR(handle))

/** Checks Reliable Write bit in attribute value referenced by pointer */
#define CY_BLE_IS_RELIABLE_WRITE_ENABLED_IN_PTR(valPtr) \
    ((0u) != (CY_BLE_CEPD_RELIABLE_WRITE & Cy_BLE_Get16ByPtr(valPtr)))

/** Checks Reliable Write bit in attribute value referenced by handle */
#define CY_BLE_IS_RELIABLE_WRITE_ENABLED(handle) \
    CY_BLE_IS_RELIABLE_WRITE_ENABLED_IN_PTR(CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_PTR(handle))

/** @} group_ble_common_api_macros_gatt_db */

#ifdef __cplusplus
}
#endif /* __cplusplus */
#endif /* CY_BLE_MODE_PROFILE */
#endif /* CY_BLE_GATT_H */


/* [] END OF FILE */
